{
  "tenantId": "mz",
  "moduleName": "HCM-ADMIN-CONSOLE",
  "ReadMeConfig": [
    {
      "type": "facilityWithBoundary",
      "texts": [
        {
          "header": "Downloading Excel Templates for setting targets:",
          "isHeaderBold": true,
          "inSheet": true,
          "inUiInfo": true,
          "descriptions": [
            {
              "text": "Download the excel template by clicking on the “Download Template” button.",
              "isStepRequired": true
            },
            {
              "text": "Open the Excel Template that was downloaded in the previous step will have 3 sheets and the first sheet you will see is a “Read Me” sheet. The Second Sheet named “List of Available Facilities“ will have a list of all the available facilities that can be used in the campaign. If there is no facility available, this sheet will be empty. The third sheet will be named “List of Campaign Boundaries“ which will have all the boundaries selected in the “Boundary Details“ step with their respective Boundary Codes.",
              "isStepRequired": true
            }
          ]
        },
        {
          "header": "Creating New Facility Data/using existing facility data once the Template is Downloaded",
          "isHeaderBold": true,
          "inSheet": true,
          "inUiInfo": true,
          "descriptions": [
            {
              "text": "If there are no Facilities available for selection, the “List of Available Facilities“ tab in the template will be empty. To create new facility data, add the name of the Facility Name, Facility Type, Facility Status, Capacity. The “Facility Code” column needs to be left empty if this is a new facility. If it is a facility being reused (which is available in the template after downloading) the user only needs to do step 2. ",
              "isStepRequired": true
            },
            {
              "text": "To map the facility to the correct boundary, the user needs to copy the correct boundary code of the boundary from the “List of Campaign Boundaries“ sheet that the facility needs to be mapped to. If there is a Facility that is mapped to multiple boundaries, the System Admin will have to add the boundary codes of all the boundaries that Facility is mapped to by separating them by commas in the cell to add Boundary Codes for that Facility.",
              "isStepRequired": true
            },
            {
              "text": "Save the sheet with the updated targets for each village on the Excel Template.",
              "isStepRequired": true
            },
            {
              "text": "Press the “Browse In My Files” button on the “Upload Facility Data” screen and select the saved file with all targets from the system.",
              "isStepRequired": true
            },
            {
              "text": "Deactivating existing Facilities for a campaign.",
              "isStepRequired": false
            },
            {
              "text": "After the user has downloaded the template for Facilities, if the system has existing facility data to be reused, the template will be pre populated with those list of Facilities.",
              "isStepRequired": false
            },
            {
              "text": "If the user then chooses not use specific facilities, they can delete those lines of data for those specific facilities that need to be removed and upload the sheet with only those facilities that are needed for the campaign with the correct boundary codes mapped to those facilities.",
              "isStepRequired": false
            }
          ]
        },
        {
          "header": "Cases for common errors:",
          "isHeaderBold": true,
          "inSheet": true,
          "inUiInfo": true,
          "descriptions": [
            {
              "text": "If the user has removed Facility codes for an existing facility in the list then system will create a duplicate Facility with those column values.",
              "isStepRequired": false
            },
            {
              "text": "If the user deletes any columns from the “List of Available Facilities” from the sheet and uplaods the sheet the system will throw an error and the user will have to download the template again and reupload the correct sheet with the correct data.",
              "isStepRequired": false
            },
            {
              "text": "If the user deletes any of the headers in the sheet and uplaods the sheet the system will throw an error and the user will have to download the template again and reupload the correct sheet with the correct data.",
              "isStepRequired": false
            }
          ]
        }
      ]
    },
    {
      "type": "userWithBoundary",
      "texts": [
        {
          "header": "Downloading Excel Templates for Creating Users:",
          "isHeaderBold": true,
          "inSheet": true,
          "inUiInfo": true,
          "descriptions": [
            {
              "text": "Download the excel template by clicking on the “Download Template” button.",
              "isStepRequired": true
            },
            {
              "text": "Open the Excel Template that was downloaded in the previous step will have 3 sheets and the first sheet you will see is a “Read Me” sheet. The Second Sheet named “Create List of Users“ that will be an empty sheet where the user needs to enter data to create users for the campaign. The third sheet will be named “List of Campaign Boundaries“ which will have all the boundaries selected in the “Boundary Details“ step with their respective Boundary Codes.",
              "isStepRequired": true
            }
          ]
        },
        {
          "header": "Creating Users for the Campaign:",
          "isHeaderBold": true,
          "inSheet": true,
          "inUiInfo": true,
          "descriptions": [
            {
              "text": "The System Admin will have to create a separate entry for each user. The System Admin will have to add The Name of the User (Mandatory), Phone Number (Non-Mandatory),Role (Mandatory) Employment Type (Mandatory). If there is a user who is mapped to multiple roles, the System Admin will have to add all the roles that user is mapped to by separating them by commas in the cell to add Roles for that user.",
              "isStepRequired": true
            },
            {
              "text": "Each user being created needs to be assigned to a Boundary using the Boundary Code of the required boundary  which can be found in the “List of Campaign Boundaries“. If there is a user who is mapped to multiple boundaries, the System Admin will have to add the boundary codes of all the boundaries that user is mapped to by separating them by commas in the cell to add Boundary Codes for that user.",
              "isStepRequired": true
            },
            {
              "text": "Save the sheet with the updated targets for each village on the Excel Template .",
              "isStepRequired": true
            },
            {
              "text": "Press the “Browse In My Files” button on the “Upload Target” screen and select the saved file with all targets from the system.",
              "isStepRequired": true
            }
          ]
        },
        {
          "header": "Cases for common errors:",
          "isHeaderBold": true,
          "inSheet": true,
          "inUiInfo": true,
          "descriptions": [
            {
              "text": "If the user has not added boundary codes for all user entries  the system will throw an error with line number where the Boundary Code is missing",
              "isStepRequired": false
            },
            {
              "text": "If the user deletes any of the headers in the sheet and uplaods the sheet the system will throw an error and the user will have to download the template again and reupload the correct sheet with the correct data.",
              "isStepRequired": false
            }
          ]
        }
      ]
    }
  ]
}
